#!/usr/bin/env python3
# -*- coding: utf-8 -*-

'''
公用、常用功能定义
'''

PROVINCE = (
 (1, '北京'),
 (2, '上海'),
 (3, '香港'),
 (4, '台湾'),
 (5, '重庆'),
 (6, '澳门'),
 (7, '天津'),
 (8, '江苏省'),
 (9, '浙江省'),
 (10, '四川省'),
 (11, '江西省'),
 (12, '福建省'),
 (13, '青海省'),
 (14, '吉林省'),
 (15, '贵州省'),
 (16, '陕西省'),
 (17, '山西省'),
 (18, '河北省'),
 (19, '湖北省'),
 (20, '辽宁省'),
 (21, '湖南省'),
 (22, '山东省'),
 (23, '云南省'),
 (24, '河南省'),
 (25, '广东省'),
 (26, '安徽省'),
 (27, '甘肃省'),
 (28, '海南省'),
 (29, '黑龙江省'),
 (30, '内蒙古自治区'),
 (31, '新疆维吾尔自治区'),
 (32, '广西壮族自治区'),
 (33, '宁夏回族自治区'),
 (34, '西藏自治区'),
 (35, '国外')
)

CITY = {
 8: ((1, '常州'),
     (2, '连云港'),
     (3, '泰州'),
     (4, '南京'),
     (5, '扬州'),
     (6, '镇江'),
     (7, '宿迁'),
     (8, '盐城'),
     (9, '徐州'),
     (10, '南通'),
     (11, '淮安'),
     (12, '无锡'),
     (340, '张家港'),
     (341, '昆山'),
     (346, '常熟'),
     (347, '丹阳'),
     (13, '苏州')),
 9: ((14, '湖州'),
     (15, '杭州'),
     (16, '舟山'),
     (17, '嘉兴'),
     (18, '衢州'),
     (19, '金华'),
     (20, '宁波'),
     (21, '台州'),
     (21, '温州'),
     (21, '义乌'),
     (342, '丽水'),
     (24, '绍兴')),
 10: ((25, '广元'),
      (26, '凉山彝族自治州'),
      (27, '绵阳'),
      (28, '资阳'),
      (29, '巴中'),
      (30, '德阳'),
      (31, '眉山'),
      (32, '甘孜藏族自治州'),
      (33, '成都'),
      (34, '乐山'),
      (35, '阿坝藏族羌族自治州'),
      (36, '内江'),
      (37, '自贡'),
      (38, '攀枝花'),
      (39, '达州'),
      (40, '宜宾'),
      (41, '泸州'),
      (42, '遂宁'),
      (43, '雅安'),
      (44, '南充'),
      (45, '广安')),
 11: ((46, '赣州'),
      (47, '上饶'),
      (48, '宜春'),
      (49, '抚州'),
      (50, '新余'),
      (51, '吉安'),
      (52, '南昌'),
      (53, '鹰潭'),
      (54, '景德镇'),
      (55, '九江'),
      (56, '萍乡')),
 12: ((57, '宁德'),
      (58, '三明'),
      (59, '福州'),
      (60, '南平'),
      (61, '龙岩'),
      (62, '莆田'),
      (63, '泉州'),
      (345, '厦门'),
      (64, '漳州')),
 13: ((65, '西宁'),
      (66, '果洛藏族自治州'),
      (67, '海东地区'),
      (68, '黄南藏族自治州'),
      (69, '海南藏族自治州'),
      (70, '海北藏族自治州'),
      (71, '玉树藏族自治州'),
      (334, '格尔木'),
      (72, '海西蒙古族藏族自治州')),
 14: ((73, '辽源'),
      (74, '延边朝鲜族自治州'),
      (75, '白城'),
      (76, '四平'),
      (77, '长春'),
      (78, '通化'),
      (79, '吉林'),
      (80, '白山'),
      (81, '松原')),
 15: ((82, '黔南布依族苗族自治州'),
      (83, '六盘水'),
      (84, '贵阳'),
      (85, '遵义'),
      (86, '铜仁地区'),
      (87, '毕节地区'),
      (88, '安顺'),
      (89, '黔东南苗族侗族自治州'),
      (343, '毕节'),
      (90, '黔西南布依族苗族自治州')),
 16: ((91, '西安'),
      (92, '延安'),
      (93, '汉中'),
      (94, '宝鸡'),
      (95, '榆林'),
      (96, '渭南'),
      (97, '咸阳'),
      (98, '安康'),
      (99, '铜川'),
      (100, '商洛')),
 17: ((101, '晋城'),
      (102, '晋中'),
      (103, '阳泉'),
      (104, '忻州'),
      (105, '朔州'),
      (106, '大同'),
      (107, '运城'),
      (108, '太原'),
      (109, '吕梁'),
      (110, '临汾'),
      (111, '长治')),
 18: ((112, '廊坊'),
      (113, '衡水'),
      (114, '邢台'),
      (115, '石家庄'),
      (116, '沧州'),
      (117, '保定'),
      (118, '邯郸'),
      (119, '张家口'),
      (120, '承德'),
      (121, '唐山'),
      (122, '秦皇岛')),
 19: ((123, '荆门'),
      (124, '十堰'),
      (125, '荆州'),
      (126, '恩施土家族苗族自治州'),
      (127, '随州'),
      (128, '黄冈'),
      (129, '咸宁'),
      (130, '宜昌'),
      (131, '襄樊'),
      (132, '孝感'),
      (132, '武汉'),
      (344, '鄂州'),
      (348, '襄阳'),
      (133, '黄石')),
 20: ((134, '营口'),
      (135, '沈阳'),
      (136, '辽阳'),
      (137, '大连'),
      (138, '朝阳'),
      (139, '抚顺'),
      (140, '本溪'),
      (141, '鞍山'),
      (142, '葫芦岛'),
      (143, '盘锦'),
      (144, '丹东'),
      (145, '锦州'),
      (146, '阜新'),
      (147, '铁岭')),
 21: ((148, '怀化'),
      (149, '长沙'),
      (150, '常德'),
      (151, '岳阳'),
      (152, '株洲'),
      (153, '湘西土家族苗族自治州'),
      (154, '张家界'),
      (155, '湘潭'),
      (156, '益阳'),
      (157, '娄底'),
      (158, '衡阳'),
      (159, '郴州'),
      (160, '永州'),
      (161, '邵阳')),
 22: ((162, '枣庄'),
      (163, '德州'),
      (164, '济南'),
      (165, '济宁'),
      (166, '菏泽'),
      (167, '滨州'),
      (168, '烟台'),
      (169, '潍坊'),
      (170, '聊城'),
      (171, '日照'),
      (172, '泰安'),
      (173, '东营'),
      (174, '临沂'),
      (175, '青岛'),
      (176, '威海'),
      (333, '莱芜'),
      (177, '淄博')),
 23: ((178, '玉溪'),
      (179, '曲靖'),
      (180, '西双版纳傣族自治州'),
      (181, '文山壮族苗族自治州'),
      (182, '德宏傣族景颇族自治州'),
      (183, '保山'),
      (184, '昭通'),
      (185, '迪庆藏族自治州'),
      (186, '普洱'),
      (187, '昆明'),
      (188, '丽江'),
      (189, '楚雄彝族自治州'),
      (190, '红河哈尼族彝族自治州'),
      (191, '临沧'),
      (192, '怒江傈僳族自治州'),
      (339, '西双版纳'),
      (193, '大理白族自治州')),
 24: ((194, '新乡'),
      (195, '驻马店'),
      (196, '南阳'),
      (197, '漯河'),
      (198, '安阳'),
      (199, '平顶山'),
      (200, '商丘'),
      (201, '开封'),
      (202, '郑州'),
      (203, '濮阳'),
      (204, '三门峡'),
      (205, '周口'),
      (206, '焦作'),
      (207, '信阳'),
      (208, '许昌'),
      (349, '鹤壁'),
      (209, '洛阳')),
 25: ((210, '广州'),
      (211, '湛江'),
      (212, '汕尾'),
      (213, '汕头'),
      (214, '梅州'),
      (215, '云浮'),
      (216, '阳江'),
      (217, '清远'),
      (218, '茂名'),
      (219, '揭阳'),
      (220, '惠州'),
      (221, '潮州'),
      (222, '河源'),
      (223, '韶关'),
      (224, '肇庆'),
      (225, '江门'),
      (225, '东莞'),
      (225, '珠海'),
      (337, '佛山'),
      (338, '中山'),
      (226, '深圳')),
 26: ((226, '六安'),
      (227, '淮南'),
      (228, '铜陵'),
      (229, '宣城'),
      (230, '阜阳'),
      (231, '宿州'),
      (232, '滁州'),
      (233, '黄山'),
      (234, '蚌埠'),
      (235, '淮北'),
      (236, '安庆'),
      (237, '亳州'),
      (238, '马鞍山'),
      (239, '巢湖'),
      (240, '芜湖'),
      (241, '池州'),
      (242, '合肥')),
 27: ((243, '临夏回族自治州'),
      (335, '临夏'),
      (244, '白银'),
      (245, '陇南'),
      (246, '金昌'),
      (247, '兰州'),
      (248, '武威'),
      (249, '定西'),
      (250, '酒泉'),
      (251, '甘南藏族自治州'),
      (252, '庆阳'),
      (253, '天水'),
      (254, '张掖'),
      (255, '平凉')),
 28: ((400, '海口'),
      (401, '三亚'),
      (402, '三沙'),
      (403, '儋州'),
      (404, '五指山'),
      (405, '琼海'),
      (406, '文昌'),
      (407, '万宁')),
 29: ((256, '齐齐哈尔'),
      (257, '大兴安岭地区'),
      (258, '鸡西'),
      (259, '黑河'),
      (260, '佳木斯'),
      (261, '哈尔滨'),
      (262, '牡丹江'),
      (263, '双鸭山'),
      (264, '七台河'),
      (265, '大庆'),
      (266, '绥化'),
      (267, '伊春'),
      (268, '鹤岗')),
 30: ((269, '兴安盟'),
      (270, '呼伦贝尔'),
      (271, '乌兰察布'),
      (272, '巴彦淖尔'),
      (273, '锡林郭勒盟'),
      (274, '鄂尔多斯'),
      (275, '通辽'),
      (276, '赤峰'),
      (277, '呼和浩特'),
      (278, '阿拉善盟'),
      (336, '乌海'),
      (279, '包头')),
 31: ((280, '伊犁哈萨克自治州'),
      (281, '博尔塔拉蒙古自治州'),
      (282, '巴音郭楞蒙古自治州'),
      (283, '乌鲁木齐'),
      (284, '和田地区'),
      (285, '喀什地区'),
      (286, '哈密地区'),
      (287, '阿勒泰地区'),
      (288, '克孜勒苏柯尔克孜自治州'),
      (289, '昌吉回族自治州'),
      (290, '阿克苏地区'),
      (291, '吐鲁番地区'),
      (292, '塔城地区')),
 32: ((293, '贵港'),
      (294, '河池'),
      (295, '贺州'),
      (296, '柳州'),
      (297, '北海'),
      (298, '玉林'),
      (299, '桂林'),
      (300, '百色'),
      (301, '钦州'),
      (302, '梧州'),
      (303, '来宾'),
      (304, '崇左'),
      (305, '南宁'),
      (306, '防城港')),
 33: ((307, '石嘴山'),
      (308, '中卫'),
      (309, '吴忠'),
      (310, '固原'),
      (311, '银川')),
 34: ((312, '那曲地区'),
      (313, '昌都地区'),
      (314, '拉萨'),
      (315, '山南地区'),
      (316, '林芝地区'),
      (317, '日喀则地区'),
      (318, '阿里地区'))
}

def strip_dashes(strTemp):
    if strTemp == "北京" :
        return "北京"
    if strTemp == "上海" :
        return "上海"
    if strTemp == "香港" :
        return "香港"
    if strTemp == "台湾" :
        return "台湾"
    if strTemp == "重庆" :
        return "重庆"
    if strTemp == "澳门" :
        return "澳门"
    if strTemp == "天津" :
        return "天津"
    province_id = 0;
    flag = False;
    for (id1, name1) in CITY.items():
        if flag :
            break;
        province_id = id1;
        for i in range(len(name1)):
            if flag :
                break;
            for j in range(2):
#                 print(name1[i][j])
                if strTemp == name1[i][j] :
                    flag = True;
                    break;
    flag = False; 
    province_name = ''           
    for i1 in range(len(PROVINCE)):
            if flag :
                break;
            for j1 in range(2):
#                 print(name1[i][j])
                if province_id == PROVINCE[i1][j1] :
                    province_name = PROVINCE[i1][j1+1]
                    flag = True;
                    break;
    return province_name

#Author:Added by tianxing
#Date:2017-10-30
#判断城市名是否被包含在location中，如果是返回相应的城市名，用于hrmcompany所述城市的获取
def getCityName(location):
    #改变方法上下两部分是解决如：昆明市北京路一号此种情况，牺牲部分效率，保证数据准确性
    for cityTuple in CITY.values():
        for (id,city) in cityTuple:
            if city in location:
                return city

    # 改变城市顺序，解决 上海市黄埔区北京东路668号科技京城西楼15层 这种情况，北京有香港路
    if u'重庆' in location:
        return u'重庆'
    if u'天津' in location:
        return u'天津'
    if u'上海' in location:
        return u'上海'
    if u'北京' in location:
        return u'北京'
    if u'香港' in location:
        return u'香港'
    if u'澳门' in location:
        return u'澳门'
    if u'台湾' in location:
        return u'台湾'

    #凡是location不为''时，且不包含城市名，则城市名统一为重庆
    return u'重庆'

#用于zhaopincompany所述城市的获取
def getCity(location):
    # 改变方法上下两部分是解决如：昆明市北京路一号此种情况，牺牲部分效率，保证数据准确性
    for cityTuple in CITY.values():
        for (id,city) in cityTuple:
            if city in location:
                return city

    #改变城市顺序，解决 上海市黄埔区北京东路668号科技京城西楼15层 这种情况，北京有香港路
    if u'重庆' in location:
        return u'重庆'
    if u'天津' in location:
        return u'天津'
    if u'上海' in location:
        return u'上海'
    if u'北京' in location:
        return u'北京'
    if u'香港' in location:
        return u'香港'
    if u'澳门' in location:
        return u'澳门'
    if u'台湾' in location:
        return u'台湾'

    return ''

def remove_cdata(str):
    pass

if __name__ == "__main__":
    a = strip_dashes("自贡")
    print(a)